# Internet

## Meaning of Internet

전 세계에 걸쳐 원거리 접속이나 파일 전송, 전자 메일 등의 데이터 통신 서비스를 받을 수 있는, 컴퓨터 네트워크의 시스템

## How to work internet

두 개의 컴퓨터가 통신할 때 다른 컴퓨터와 물리적(이더넷 케이블) 또는 무선(Wifi, Bluetooth) 등으로 연결되어야 한다. 

예를 들어 10대의 컴퓨터가 연결된다고 가정하였을 때 컴퓨터 한 대당 9개의 케이블이 필요하며 총 45개의 케이블이 필요하다

 이는 굉장히 복잡하고 비효율적이기 때문에 라우터라고 하는 특수한 소형 컴퓨터에 연결된다. 이 라우터는 하나의 작업만 하며, 컴퓨터에서 보낸 
메시지가 올바른 컴퓨터에 도착하는지 확인
A에서 라우터를 거쳐서 B로 이송된다. 여기서 C로 데이터가 전송되지 
않게 막아준다. 이 라우터를 시스템에 추가하면 컴퓨터마다 단일 플러그와 10개의 플러그가 있는 하나의 라우터만 있으면 된다.

## A network of networks

그렇다면 수백, 수천, 수십억대의 컴퓨터를 연결한다고 가정했을 때 단일 라우터는 그 정도로 확장할 수 없다.
라우터도 컴퓨터이기 때문에 여러 대의 라우터를 연결하여 무한히 확장 이러한 네트워크는 우리가 부르는 네트워크에 매우 가깝지만, 라우터를 이용한다면 아주 멀리 떨어져 있는 곳에는 연결할 수 없다. 전화기 기반 시설은 이미 세계 어느 곳과도 연결되어 있으므로, 우리가 필요로 하는 완벽한 배선이다. 따라서 네트워크와 전화 시설을 연결하기 위해서는 모뎀이라는 특수 장비가 필요 모뎀은 우리 네트워크의 정보를 전화 시설에서 처리할 수 있는 정보로 바꾸며, 그 반대도 가능 그래서 우리 네트워크는 전화 시설에 연결

다음 단계로 우리의 네트워크에서 도달하려는 네트워크로 메시지를 보내는 것
그렇게 하기 위해 네트워크를 ISP(Internet Service Provider)에 연결. ISP는 함께 연결되는 몇몇 특수한 라우터를 관리하고 다른 ISP의 라우터에도 액세스할 수 있는 회사다. 따라서 우리 네트워크의 메시지는 ISP 네트워크의 네트워크를 통해 대상 네트워크로 전달. 인터넷은 이러한 전체 네트워크 인프라로 구성

## Finding computers
 컴퓨터에 메시지를 보내려면 메시지를 받을 특정 컴퓨터를 지정해야 한다. 따라서 네트워크에 연결된 모든 컴퓨터에는 IP(Internet Protocol)주소라는 고유한 주소가 있다. 주소는 점으로 구분된 네 개의 숫자로 구성된 주소 ex) 192.168.2.10.

 컴퓨터는 이러한 주소로 다른 컴퓨터를 찾아가는데 문제가 없지만 우리가 IP주소를 기억하기는 어렵다. 그래서 사람이 읽을 수 있는 IP주소의 이름을 지정할 수 있다. 이를 도메인 이름이라 부른다. 예를 들어 구글의 IP주소인 '173.194.121.32' 대신 'google.com'으로 사용하는 것이다.

## Internet and the web

 웹 브라우저를 사용하여 웹을 탐색할 때 일반적으로 도메인 이름을 사용하여 웹 사이트에 접속한다. 그것은 인터넷과 웹이 같은 것을 의미할까? 그렇게 간단하지 않다. 앞에서 보았듯 인터넷은 수십억대의 컴퓨터를 모두 연결하는 기술 인프라이다. 이러한 컴퓨터들 중 일부는 '웹 서버'로서 웹 브라우저가 이해할 수 있는 서비스를 제공한다. 인터넷은 인프라이며, 웹은 그 인프라 기반 위에 구축된 서비스 웹뿐만 아니라 인터넷 위에 구축된 다른 서비스들(email, IRC)등도 있음을 알아야 한다.

## Intranets and Extranets

인트라넷은 특정 조직의 구성원으로 제한된 사설 네트워크이다. 일반적으로 구성원이 공유 리소스에 안전하게 액세스하고 협업하고 의사소통할 수 있는 포털을 제공하는 데 사용된다. 예를 들어 조직의 
인트라넷은 부서 또는 팀 정보를 공유하기 위한 웹 페이지, 주요 문서 및 파일을 관리하기 위한 공유 드라이브, 비즈니스 관리 작업을 수행하기 위한 
포털, Wiki, 토론 게시판 및 메시지 시스템과 같은 공동 작업 도구를 호스팅 할 수 있다.

 엑스트라넷은 다른 조직과의 공유 및 협업을 허용하기 위해 사설 네트워크의 전체 또는 일부를 개방한다는 점을 제외하고는 인트라넷과 매우 유사하다. 일반적으로 비즈니스와 긴밀하게 협력하는 고객 및 이해 관계자와 정보를 안전하고 안전하게 공유하는 데 사용된다. 종종 그들의 기능은 정보 및 파일 공유, 협업 도구, 토론 게시판 등 인트라넷에서 제공하는 기능과 유사하다.

 인트라넷과 엑스트라넷은 모두 인터넷과 동일한 종류의 인프라에서 실행되며 동일한 프로토콜을 사용한다. 따라서 다른 물리적 위치에서 승인된 구성원이 액세스할 수 있다.

## Meaning of HTTP

 인터넷 데이터 통신 규약(Hyper Text Transfer Protocol)
텍스트 기반의 통신 규약으로 인터넷에서 주고받을 수 있는 프로토콜이다. 이렇게 규약을 정해두었기 때문에 모든 프로그램이 이 규약에 맞춰 개발해서 서로 정보를 교환할 수 있게 되었다.

## HTTP Action

사용자가 브라우저를 통해서 어떠한 서비스를 url을 통하거나 다른 것을 통해서 요청을 하면 서버에서는 요청사항에 맞는 결과를 찾아서 사용자에게 응답하는 형태로 동작한다.

요청 : client -> server
응답 : server -> client

HTML 문서만이 HTTP 통신을 위한 유일한 정보 문서는 아니다.
Plain text로부터 JSON 데이터 및 XML과 같은 형태의 정보도 주고받을 수 있으며, 보통은 클라이언트가 어떤 정보를 HTML 형태로 받고 싶은지, JSON 형태로 받고 싶은지 명시해주는 경우가 많다.

## Characteristic of HTTP
HTTP 메시지는 HTTP 서버와 HTTP 클라이언트에 의해 해석이 되며, TCP/ IP를 이용하는 응용 프로토콜이다.
연결 상태를 유지하지 않는 비 연결성 프로토콜이기 때문에 요청/응답 방식으로 동작하며, 비 연결성이라는 문제성을 해결하기 위해 Cookie와 Session이 등장하였다.

※ TCP/ IP : 컴퓨터와 컴퓨터 사이에 데이터를 전송할 수 있도록 하는 장치로 인터넷이라는 거대한 통신망을 통해 원하는 데이터를 주고 받는 기능을 이용하는 응용 프로토콜

## Response

서버가 요청에 대한 답변을 클라이언트에게 보내는 것

## Status code

상태 코드는 모두 세 자리로 이루어져 있으며, 아래와 같이 크게 다섯 부류로 나눌 수 있다.

1XX (조건부 응답) : 요청을 받았으며 작업을 계속한다.
2XX (성공) : 클라이언트가 요청한 동작을 수신하여 이해했고 승낙했으며 성공적으로 처리했음을 가리킨다.
3XX (리다이렉션 완료) : 클라이언트는 요청을 마치기 위해 추가 동작을 취해야 한다.
4XX (요청 오류) : 클라이언트에 오류가 있음을 나타낸다.
5XX (서버 오류) : 서버가 유효한 요청을 명백하게 수행하지 못했음을 나타낸다.

## Response HTTP Message Example

![image](https://user-images.githubusercontent.com/82091740/187467962-95f5146a-30cf-4384-92a4-f64961c0d9b9.png)

1. 시작줄 (첫 줄)
 버전, 상태 코드, 상태 메시지로 구성되어 있다. 200은 성공적인 요청이었다는 뜻이다.

2. 헤더 (두 번째 줄부터)
 두 번째 줄부터는 헤더로 응답에 대한 정보를 담고 있다.

3. 본문 (헤더 뒤부터)
 응답에는 대부분의 경우 본문이 있다. 보통 데이터를 요청하고 응답 메시지에는 요청한 데이터를 담아서 보내주기 때문이다. 응답 메시지에 HTML이 담겨 있는데 이 HTML을 받아 브라우저가 화면에 렌더링 한다.

## Meaning of Browser

웹페이지, 이미지, 비디오 등의 콘텐츠를 수신, 전송 및 표현하는 소프트웨어다.

## Characteristic of Browser

 각 브라우저는 서로 다른 데이터를 해석 방식을 갖고 있을 수 있기 때문에 특정 웹사이트의 외관 또는 기능이 브라우저마다 다르게 표현될 수 있다. 개발자는 브라우저간의 지속성을 유지하기 위해 웹 표준을 고려한다.

## How the Browser Works

 브라우저는 클라이언트/서버 모델로써 클라이언트는 웹서버에 접속하고 정보를 요청하는 컴퓨터를 운영한다. 웹 서버는 해당 정보를 HTTP를 따라 웹 브라우저에 전송하며, 웹 브라우저는 해당 결과를 표시한다. 브라우저는 서버로부터 데이터를 전송받고, 렌더링 엔진을 이용해 이를 텍스트 및 이미지 등으로 변환한다. 해당 데이터는 HTML 코드로 작성되어 있으며, 브라우저는 이러한 HTML코드를 읽고 최종 화면을 사용자에게 표시하는 역할을 한다.

## Type of Browser 

1. Internet Explorer        2. Microsoft Edge         3. Google Chrome 4. Mozilla Firefox          5. Apple Safari          6. Operasoftware Opera 7. Naver Whale            8. Vivaldi

## Meaning of DNS(Domain Name System)

도메인 이름은 점으로 구분되고 오른쪽에서 왼쪽으로 읽히는 여러 부분(한 부분, 두 부분...)으로 구성된 간단한 구조를 가지고 있다.

### TLD(Top-Level Domain)

TLD는 사용자에게 도메인 이름 뒤에 있는 서비스의 일반적인 목적을 알려준다. 가장 일반적인 TLD(com, org, net)는 웹 서비스가 특정 기준을 충족할 것을 요구하지 않지만 일부 TLD는 더 엄격한 정책을 적용하므로 목적이 무엇인지 더 명확하다. 
ex) : .us, .fr, .se 같은 로컬 TLD는 서비스가 특정 언어로 제공되거나 특정 국가에서 호스팅 되도록 요구할 수 있고, 특정 언어 또는 국가의 리소스를 나타내야 한다.
.gov TLD는 정부 부서에서만 사용할 수 있으며, .edu TLD는 교육 및 학술 기관에서만 사용할 수 있다.

TLD에는 특수 문자와 라틴 문자가 포함될 수 있으며, 최대 길이는 63자이지만 대부분은 약 2~3자다. 그리고 전체 목록은 ICANN에서 유지 관리한다.

### Lable(or Component)

레이블은 TLD 다음에 오는 것이다. 레이블은 A에서 Z까지의 문자, -, 0에서 9까지의 숫자 가 올 수 있다.

TLD 바로 앞에 있는 레이블을 SLD(Secondary Level Domain)라고도 한다.

도메인 이름에는 많은 레이블이 있을 수 있다. 도메인 이름을 형성하기 위해 3개의 레이블이 있어야 하는 것은 필수도 아니고 필수도 아니다. 예를 들어 www.inf.ed.ac.uk는 유효한 도메인 이름이다. 제어하는 모든 도메인에 대해 developer.mozilla.org , iot.mozilla.org 또는 bugzilla.mozilla.org 와 같이 각각에 있는 다른 콘텐츠로 "하위 도메인"을 만들 수 있다.

## Who owns a domain name?

 도메인 이름을 구입할 수 없다. 이는 사용하지 않은 도메인 이름이 결국 다른 사람이 다시 사용할 수 있도록 하기 위한 것이다. 모든 도메인 이름을 구입한 경우 웹은 잠겨 있어 아무도 사용할 수 없는 사용하지 않는 도메인 이름으로 빠르게 채워진다.

대신 1년 이상 도메인 이름을 사용할 수 있는 권한에 대해 비용을 지불한다. 물론 권리를 갱신할 수 있으며 당신의 갱신은 다른 사람의 신청보다 우선이다.

※ 일부 도메인 이름의 경우 추적을 담당하는 등록 기관이 아닐 수 있다.

## Finding an available domain name

WHOIS라는 사이트에 접속하여 도메인 이름을 치면, 도메인 이름을 사용할 수 있는지를 알려준다.

## Getting a domain name

1. 등록 기관의 웹 사이트로 이동한다.
2. 일반적으로 눈에 띄는 "도메인 이름 가져오기" 클릭 유도 문안을 클릭해라.
3. 필요한 양식을 작성해라. 특히 원하는 도메인 이름의 철자가 틀리지 않았는지 확인해라.
4. 도메인 이름이 제대로 등록되면 등록 기관에서 알려준다. 몇 시간 내에 모든 DNS 서버가 DNS 정보를 수신하게 된다.

※ 이 과정에서 등록 기관은 실제 주소를 묻는다. 일부 국가에서는 등록 대행자가 유효한 주소를 제공할 수 없는 경우 도메인을 강제로 폐쇄할 수 있으므로 올바르게 입력해야 한다.

## DNS refreshing

 DNS 데이터베이스는 전 세계의 모든 DNS 서버에 저장되며 이 모든 서버는 "권한 있는 이름 서버" 또는 "TLD 서버"라는 몇 가지 특수 서버를 나타낸다. 이들은 시스템을 관리하는 보스 서버와 같다.

등록 대행자가 특정 도메인에 대한 정보를 생성하거나 업데이트할 때마다 모든 DNS 데이터베이스에서 정보를 새로 고쳐야 한다. 주어진 도메인에 대해 알고 있는 각 DNS 서버는 정보가 자동으로 무효화되고 새로 고쳐지기 전에 일정 시간 동안 정보를 저장한다(DNS 서버는 권한 있는 서버에 쿼리하고 업데이트된 정보를 가져옴). 따라서 이 도메인 이름을 알고 있는 DNS 서버가 최신 정보를 얻는 데 시간이 걸린다.

## How does a DNS request work?

1. 웹 브라우저에 도메인 이름을 입력하면 먼저 Local DNS에게 hostname에 대한 IP 주소를 질의하여 Local DNS에 없으면 다른 DNS name 서버 정보를 받는다.
(Root DNS 정보 전달 받음)
2. Root DNS 서버에 도메인 이름 질의
3. Root DNS 서버로부터 com 도메인을 관리하는 TLD (Top-Level Domain) 이름 서버 정보 전달 받음
4. TLD에 도메인 이름 질의
5. TLD에서 name.com 관리하는 DNS 정보 전달
6. naver.com 도메인을 관리하는 DNS 서버에  호스트네임에 대한 IP 주소 질의
7. Local DNS 서버에게 "응! www.naver.com에 대한 IP 주소는 222.122.195.6 응답
8. Local DNS는 www.naver.com에 대한 IP 주소를 캐싱을 하고 IP 주소 정보 전달

## Hosting

호스팅 서비스는 사용자가 서버 컴퓨터를 빌려 쓸 수 있는 서비스
서버 자원을 빌려준다는 점에서 클라우드 서비스와 비슷하지만 유연성, 효율성, 신속성 측면에서 차이가 있다. 서버를 어떻게 호스팅 하냐에 따라 웹 호스팅, 서버 호스팅, 코로케이션 3가지로 분류한다. 

호스팅 서비스는 물리 서버를 구축해 서비스를 제공한다. 호스팅 전문 업체는 여러 대의 서버 컴퓨터를 확보해둔 뒤 이를 사용자에게 빌려주는 대신 돈을 받는다.[선불제]

클라우스 서비스 또한 사용자에게 서버를 빌려준다는 점에서 비슷하다. 다만 클라우드 서비스는 물리 서버를 가상화해 빌려준다는 점에서 호스팅 서비스와의 차이점이 있다. 가상화된 서버는 사용자가 필요한 시점 바로 사용할 수 있으며, 서비스 개발이나 테스트 등 서버를 운영하면서 발생하는 부하에 따라 언제든지 서버 자원을 늘리거나 줄일 수 있다. [후불제]


### 웹 호스팅
사용자가 이미 세팅이 완료된 웹 서버의 일정 공간을 빌려서 사용하는 서비스
사용자는 웹 서버를 직접 설치하지 않고도 인터넷에 홈페이지를 개설, 운영할 수 있다. 웹 서버는 여러 사용자가 공동으로 사용할 수 있다. 여러 사용자가 공동으로 사용하기에 사용료가 저렴하다. 다만 특정 사용자가 서버 자원을 과도하게 사용하게 되면 다른 사용자에게도 영향이 간다.

### 서버 호스팅
사용자가 서버 전체를 독점해 자유롭게 이용할 수 있는 서비스
서버 통제 권한을 최대한으로 얻을 수 있다. 높은 서버 성능, 원하는 환경이나 설정 등의 조건을 직접 결정해 최적화된 환경에서 서비스 이용 가능

### 코로케이션
사용자가 소유하고 있는 서버를 호스팅 전문 업체에 위탁해 운영하는 것
사용자는 호스팅 업체의 인터넷 데이터 센터에 서버를 맡기고 네트워크 회선을 빌려 사용한다. 주로 서버를 둘 장소가 없거나 관리 인력이 부족한 경우 코로케이션을 이용한다. 
